
final List<String> SwitchModules = [
  "なし",
  //ABB
  "ABB 2ボタン(ホワイト艶消し)",
  "ABB 4ボタン(ホワイト艶消し)",
  "ABB 8ボタン(ホワイト艶消し)",
  "ABB 8ボタン(ホワイト)",
  "ABB 8ボタン(アイボリー)",
  "ABB 8ボタン(アルミニウムシルバー)",
  "ABB スイッチフレーム[枠]（ホワイト艶消し）",
  "ABB スイッチフレーム[枠]（ホワイト）",
  "ABB スイッチフレーム[枠]（アイボリー）",
  "ABB スイッチフレーム[枠]（アルミニウムシルバー）",
  "ABB バスカプラ",
  "ABB tacteo6ボタンスイッチ",
  "ABB tacteo4ボタンスイッチ",
  "ABB tacteo2ボタンスイッチ",
  "ABB　サーモスタット対応"
  "ABB IP touch 7 (white)",
  "ABB IP touch 7 (Black)",
  "ABB IP touch 7用 Box (white)",
  "ABB IP touch 7用 Box (black)",
  "ABB IP touch 10 (white)",
  "ABB IP touch 10 (Black)",
  "ABB IP touch 10用 Box (white)",
  "ABB IP touch 10用 Box (black)",
  "ABB plug-in power suppiy 24V DC",
  "人感・照度センサー 白(6131/21-24-500)",
  "人感・照度センサー 黒(6131/21-183-500)",
  "人感・照度センサー 白(6131/31-24-500)",
  "人感・照度センサー 黒6131/31-183-500",
  "6131/21-xxx用　取付BOX　白",
  "6131/21-xxx用　取付BOX　シルバー",
  "人感・照度センサー廊下用　 白",
  "人感・照度センサー 廊下用　シルバー",
  "GPSセンサ（時刻補正器）",


  //HDL
  "HDL 2ボタン・1アイコン",
  "HDL 2ボタン・2アイコン",
  "HDL 4ボタン・2アイコン",
  "HDL 4ボタン・4アイコン",
  "HDL 8ボタン・4アイコン",
  "HDL 8ボタン・8アイコン",
  "HDL 2ボタン・1アイコン（メタル）",
  "HDL 2ボタン・2アイコン（メタル）",
  "HDL 4ボタン・2アイコン（メタル）",
  "HDL 4ボタン・4アイコン（メタル）",
  "HDL 8ボタン・4アイコン（メタル）",
  "HDL 8ボタン・8アイコン（メタル）",
  "HDL バスカプラ(赤/黒)",
  "HDL スイッチフレーム[枠]",
  "HDL スイッチフレーム[枠](メタル）",
  "HDL　サーモスタット対応",
  "HDL タッチパネル35.1(アイボリー)", ///애는 커버 필요함
  "HDL タッチパネル35.1(アッシュグレー)",///애는 커버 필요함
  "HDL タッチパネル35.1(メタル)",///애는 커버 필요함
  "HDL バスカプラ(赤/黒/白/黄)",
  "HDL タッチパネル 4.1(スペースグレイフレーム)", ///버스커플러 있음
  "HDL タッチパネル 4.1(ブラックガラス)", ///버스커플러 있음
  "HDL タッチパネル 43.1(スペースグレイフレーム)", ///버스커플러 있음
  "HDL タッチパネル 43.1(ブラックガラス)", ///버스커플러 있음
  "HDL 前施工型裏ボックス",
  "人感・照度センサー　天井直付け型",
  "赤外線発信機",


  //Enertex
  "enertex standard 4ボタン×4ページ",
  "enertex premium 8ボタン×4ページ",

  //GVS
  "GVS KNX-SmartTouch10",
  "GVS SmartTouch10用BOX(ABB)",

  //NANOTECO
  "NANOTECO 欧州仕様スイッチカバー（塗代タイプ）",

  //Simet
  "取付Box （φ68／H58.5／深型オレンジ）",
  "取付Box（φ68／H58.5／深型ブルー）",
  "取付Box（φ68／H42／浅型ブルー）",
  "Box連結部品",

  //旭金属
  "鋼製JIS規格アウトレットボックス（中形四角浅型鉄)",
];

final List<double> SwitchCash = [
  0,  //なし
  11250,  //ABB 2ボタン(ホワイト艶消し)
  13730,  //ABB 4ボタン(ホワイト艶消し)
  18280,  //ABB 8ボタン(ホワイト艶消し)
  15320,  //ABB 8ボタン(ホワイト)
  14450,  //ABB 8ボタン(アイボリー)
  15640,  //ABB 8ボタン(アルミニウムシルバー)
  1160,  //ABB スイッチフレーム（ホワイト艶消し）
  560,  //ABB スイッチフレーム（ホワイト）
  680,  //ABB スイッチフレーム（アイボリー）
  1120,  //ABB スイッチフレーム（アルミニウムシルバー）
  13310,  //ABB バスカプラ
  49450,  //ABB tacteo6ボタンスイッチ
  43440,  //ABB tacteo4ボタンスイッチ
  33770,  //ABB tacteo2ボタンスイッチ
  28830, //ABB　サーモスタット対応
  152190,  //ABB IP touch 7 (white)
  152190,  //ABB IP touch 7 (Black)
  5440,  //ABB IP touch 7用 Box (white)
  5440,  //ABB IP touch 7用 Box (black)
  185370,  //ABB IP touch 10 (white)
  185370,  //ABB IP touch 10 (Black)
  6120,  //ABB IP touch 10用 Box (white)
  6120,  //ABB IP touch 10用 Box (black)
  11700,  //ABB plug-in power suppiy 24V DC
  22910,  //人感・照度センサー 白(6131/21-24-500)",
  27950,  //人感・照度センサー 黒(6131/21-183-500)",
  27860,  //人感・照度センサー 白(6131/31-24-500)",
  34320,  //人感・照度センサー 黒6131/31-183-500",
  1650,  //6131/21-xxx用　取付BOX　白",
  2490,  //6131/21-xxx用　取付BOX　シルバー",
  31220,  //人感・照度センサー廊下用　 白",
  32670,  //人感・照度センサー 廊下用　シルバー",
  38230,  //GPSセンサ（時刻補正器）",


//HDL
  6350, //HDL 2ボタン・1アイコン
  7360, //HDL 2ボタン・2アイコン
  7360, //HDL 4ボタン・2アイコン
  7790, //HDL 4ボタン・4アイコン
  8210, //HDL 8ボタン・4アイコン
  9310, //HDL 8ボタン・8アイコン
  7800, //HDL 2ボタン・1アイコン（メタル）
  8810, //HDL 2ボタン・2アイコン（メタル）
  8810, //HDL 4ボタン・2アイコン（メタル）
  9240, //HDL 4ボタン・4アイコン（メタル）
  9660, //HDL 8ボタン・4アイコン（メタル）
  10760, //HDL 8ボタン・8アイコン（メタル）
  5080, //HDL バスカプラ
  260, //HDL スイッチフレーム[枠]
  1470, //HDL スイッチフレーム[枠](メタル）
  15060,  //HDL　サーモスタット対応
  29020,  //HDL タッチパネル35.1(アイボリー)
  29020,  //HDL タッチパネル35.1(アッシュグレー)
  29020,  //HDL タッチパネル35.1(メタル)
  5080,  //HDL バスカプラ(赤/黒/白/黄)
  33840,  //HDL タッチパネル 4.1(スペースグレイフレーム)
  33840,  //HDL タッチパネル 4.1(ブラックガラス)
  35360,  //HDL タッチパネル 43.1(スペースグレイフレーム)
  35360,  //HDL タッチパネル 43.1(ブラックガラス)
  1200,  //HDL前施工型裏ボックス
  15480, //人感・照度センサー　天井直付け型
  10150,  //赤外線発信機

//Enertex
  0, //enertex standard 4ボタン×4ページ
  0, //enertex premium 8ボタン×4ページ

  //GVS
  95610,  //GVS KNX-SmartTouch10
  8690,  //GVS SmartTouch10用BOX(ABB)

  //NANOTECO
  230,

  //Simet
  700,  //取付Box （φ68／H58.5／深型オレンジ）
  700,  //取付Box（φ68／H58.5／深型ブルー）
  250,  //取付Box（φ68／H42／浅型ブルー）
  700,  //Box連結部品

  //旭金属
  325,  //鋼製JIS規格アウトレットボックス（中形四角浅型鉄

];

final List<String> SwitchCode = [
  "null",  //なし
  //ABB
  "6125/02-884-500",  //ABB 2ボタン(ホワイト艶消し)
  "6126/02-884-500",  //ABB 4ボタン(ホワイト艶消し)
  "6127/02-884-500",  //ABB 8ボタン(ホワイト艶消し)
  "6127/02-84-500",  //ABB 8ボタン(ホワイト)
  "6127/02-82-500",  //ABB 8ボタン(アイボリー)
  "6127/02-83-500",  //ABB 8ボタン(アルミニウムシルバー)
  "1721-884K-500",  //ABB スイッチフレーム（ホワイト艶消し）
  "1721-184K-500",  //ABB スイッチフレーム（ホワイト）
  "1721-182K-500",  //ABB スイッチフレーム（アイボリー）
  "1721-183K-500",  //ABB スイッチフレーム（アルミニウムシルバー）
  "6120/12-101-500",  //ABB バスカプラ
  "TB/U6.4.1-CG",  //ABB tacteo6ボタンスイッチ
  "TB/U4.4.1-CG",  //ABB tacteo4ボタンスイッチ
  "TB/U1.1.1-CG",  //ABB tacteo2ボタンスイッチ
  "6128/28-884-500"  //ABB　サーモスタット対応
  "H8236-5W",  //ABB IP touch 7 (white)
  "H8236-5B",  //ABB IP touch 7 (Black)
  "42361S-W-03",  //ABB IP touch 7用 Box (white)
  "42361S-B-03",  //ABB IP touch 7用 Box (black)
  "H8237-5W",  //ABB IP touch 10 (white)
  "H8237-5B",  //ABB IP touch 10 (Black)
  "42371S-W",  //ABB IP touch 10用 Box (white)
  "42371S-B",  //ABB IP touch 10用 Box (black)
  "53011PS-03",  //ABB plug-in power suppiy 24V DC
  "6131/21-24-500",  //ABB 人感・照度センサー 白(6131/21-24-500)",
  "6131/21-183-500",  //ABB 人感・照度センサー 黒(6131/21-183-500)",
  "6131/31-24-500",  //ABB 人感・照度センサー 白(6131/31-24-500)",
  "6131/31-183-500",  //ABB 人感・照度センサー 黒6131/31-183-500",
  "6131/29-24-500",  //ABB 6131/21-xxx用　取付BOX　白",
  "6131/29-24-500",  //ABB 6131/21-xxx用　取付BOX　シルバー",
  "6131/50-24-500",  //ABB 人感・照度センサー廊下用　 白",
  "6131/50-183-500",  //ABB 人感・照度センサー 廊下用　シルバー",
  "TR/A1.1",  //GPSセンサ（時刻補正器）",


  //HDL
  "HDL-M/PT1RA.1",  //HDL 2ボタン・1アイコン
  "HDL-M/PT1RB.1",  //HDL 2ボタン・2アイコン
  "HDL-M/PT2RA.1",  //HDL 4ボタン・2アイコン
  "HDL-M/PT2RB.1",  //HDL 4ボタン・4アイコン
  "HDL-M/PT4RA.1",  //HDL 8ボタン・4アイコン
  "HDL-M/PT4RB.1",  //HDL 8ボタン・8アイコン
  "HDL-M/PT1RA.1",  //HDL 2ボタン・1アイコン（メタル）
  "HDL-M/PT1RB.1",  //HDL 2ボタン・2アイコン（メタル）
  "HDL-M/PT2RA.1",  //HDL 4ボタン・2アイコン（メタル）
  "HDL-M/PT2RB.1",  //HDL 4ボタン・4アイコン（メタル）
  "HDL-M/PT4RA.1",  //HDL 8ボタン・4アイコン（メタル）
  "HDL-M/PT4RB.1",  //HDL 8ボタン・8アイコン（メタル）
  "HDL-M/PTCI.1",  //HDL バスカプラ
  "HDL-MP1-EC/TILE.48",  //HDL スイッチフレーム[枠]
  "HDL-MP1-EC/TILE.48",  //HDL スイッチフレーム[枠](メタル）
  "M/PTOL6.1",  ////HDL　サーモスタット対応
  "M/PTL35.1",  ////HDL タッチパネル35.1(アイボリー)
  "M/PTL35.1",  ////HDL タッチパネル35.1(アッシュグレー)
  "M/PTL35.1",  ////HDL タッチパネル35.1(メタル)
  "HDL-M/PTCI2P.1",  ////HDL バスカプラ(赤/黒/白/黄)
  "M/PTL4.1",  ////HDL タッチパネル 4.1(スペースグレイフレーム)
  "M/PTL4.1",  ////HDL タッチパネル 4.1(ブラックガラス)
  "M/PTL43.1",  ////HDL タッチパネル 43.1(スペースグレイフレーム)
  "M/PTL43.1",  ////HDL タッチパネル 43.1(ブラックガラス)
  "Metal Back Box for Tile Series Panel", //HDL前施工型裏ボックス
  "M/HSD24.1",  //人感・照度センサー　天井直付け型
  "HDL-M/IRAC.1", //赤外線発信機



  //Enertex
  "Enertex 1157-01",  //enertex standard 4ボタン×4ページ
  "Enertex 1157-02",  //enertex premium 8ボタン×4ページ

  //GVS
  "A-IS03（Starry Grey)", //GVS KNX-SmartTouch10
  "6136/07 UP-500", //GVS SmartTouch10用BOX(ABB)

  //NANOTECO
  "NTP-PBP/001-01",

  //Simet
  "P60DF／31074008",  //取付Box （φ68／H58.5／深型オレンジ）
  "PV60D／32013203",  //取付Box（φ68／H58.5／深型ブルー）
  "PV60K／32017203",  //取付Box（φ68／H42／浅型ブルー）
  "KD71／37015003",  //Box連結部品

  //旭金属
  "中形四角浅型鉄　44-16-22B",  //鋼製JIS規格アウトレットボックス（中形四角浅型鉄

];


